### Uzdevum praksei ar bibliotēku Pandas

1. Importējiet bibliotēku pandas un attēlojiet tās versiju

In [6]:
import pandas as p
p.__version__

'2.1.1'

2. Izveidojiet pandas DataFrame no Python List, Python Tuple un numpy.array

In [8]:
# Python List
li = [1, 2, 3, 4, 5, 6, 7, 8,]
df = p.DataFrame(li)
print(df)

   0
0  1
1  2
2  3
3  4
4  5
5  6
6  7
7  8

In [9]:
# Python Tuple
tpl =(1, 2)
dff = p.DataFrame(tpl)
print(dff)

   0
0  1
1  2

In [11]:
# Numpy.array
import numpy as n
arr = n.array([1,2,3,4,5])
dfff = p.DataFrame(arr)
print (dfff)

   0
0  1
1  2
2  3
3  4
4  5

3. Izveidojiet pandas series, kas satur vērtības: 10,20,30,40,50, un rindu indekss vērtībām: A,B,C,D & E

In [12]:
p.Series([10, 20, 30, 40, 50], index=['A', 'B', 'C', 'D', 'E'])

A    10
B    20
C    30
D    40
E    50
dtype: int64

4. Izveidojiet 2 series:
    - ser1 ar gadījuma vēseliem skaitļiem no 10 līdz 50
    - ser2 ar gadījuma vēseliem skaitļiem no 60 līdz 100
    
   Konvertējiet Series uz DataFrame, izmantojot pd.concat() funkciju

In [13]:
#import numpy as n

ser1 = p.Series(n.random.randint(10, 51, 5))
ser2 = p.Series(n.random.randint(60, 101, 5))

p.concat([ser1, ser2], axis=1)

    0   1
0  13  88
1  31  83
2  25  92
3  10  90
4  25  74

5. Izveidojiet DataFrame, izmantojot numpy.array ar shape=(5,6). Izmantojit jebkuru derīgo funkciju datu ģenerēšanai.

In [14]:
p.DataFrame(n.random.randint(-10,25, (5,6)))

    0   1   2   3   4   5
0  16  23  -7  22  -7  -9
1  11  -7 -10   8  17   3
2  13   5   4   7   9   7
3  24   2  11   2   4  18
4  19  18  -4  13  12  10

6. Izveidojiet DataFrame izmantojot np.random.randint(10,150,(5,5)), un atgrieziet dataframe kur vērtības ir mazākas pār 100

In [18]:
ff = p.DataFrame(n.random.randint(10,150, (5,5))) 
print(ff[ff< 100])

    0     1     2     3     4
0  19  68.0  43.0   NaN   NaN
1  76   NaN  40.0   NaN  74.0
2  64  47.0   NaN   NaN  53.0
3  32  55.0  79.0   NaN  18.0
4  97  44.0  45.0  66.0   NaN

7. Ielādējiet datu no datnes "housing.csv"

In [21]:
f = p.read_csv('housing.csv')

8. Attēlojiet pirmās 10 rindas no ielādētiem datiem?

In [24]:
f[:10]

,Avg. Area Income,Avg. Area House Age,Avg. Area Number of Rooms,Avg. Area Number of Bedrooms,Area Population,Price,Address
0,79545.458574,5.682861,7.009188,4.09,23086.800503,1.059034e+06,"208 Michael Ferry Apt. 674\nLaurabury, NE 3701..."
1,79248.642455,6.002900,6.730821,3.09,40173.072174,1.505891e+06,"188 Johnson Views Suite 079\nLake Kathleen, CA..."
2,61287.067179,5.865890,8.512727,5.13,36882.159400,1.058988e+06,"9127 Elizabeth Stravenue\nDanieltown, WI 06482..."
3,63345.240046,7.188236,5.586729,3.26,34310.242831,1.260617e+06,USS Barnett\nFPO AP 44820
4,59982.197226,5.040555,7.839388,4.23,26354.109472,6.309435e+05,USNS Raymond\nFPO AE 09386
5,80175.754159,4.988408,6.104512,4.04,26748.428425,1.068138e+06,"06039 Jennifer Islands Apt. 443\nTracyport, KS..."
6,64698.463428,6.025336,8.147760,3.41,60828.249085,1.502056e+06,"4759 Daniel Shoals Suite 442\nNguyenburgh, CO ..."
7,78394.339278,6.989780,6.620478,2.42,36516.358972,1.573937e+06,"972 Joyce Viaduct\nLake William, TN 17778-6483"
8,59927.660813,5.362126,6.393121,2.30,29387.396003,7.988695e+05,USS Gilbert\nFPO AA 20957
9,81885.927184,4.423672,8.167688,6.10,40149.965749,1.545155e+06,Unit 9446 Box 0958\nDPO AE 97025

9. Pielietojiet funkciju describe() DataFrame ar ielādētiem datiem.

In [25]:
f.describe()

,Avg. Area Income,Avg. Area House Age,Avg. Area Number of Rooms,Avg. Area Number of Bedrooms,Area Population,Price
count,5000.000000,5000.000000,5000.000000,5000.000000,5000.000000,5.000000e+03
mean,68583.108984,5.977222,6.987792,3.981330,36163.516039,1.232073e+06
std,10657.991214,0.991456,1.005833,1.234137,9925.650114,3.531176e+05
min,17796.631190,2.644304,3.236194,2.000000,172.610686,1.593866e+04
25%,61480.562388,5.322283,6.299250,3.140000,29403.928702,9.975771e+05
50%,68804.286404,5.970429,7.002902,4.050000,36199.406689,1.232669e+06
75%,75783.338666,6.650808,7.665871,4.490000,42861.290769,1.471210e+06
max,107701.748378,9.519088,10.759588,6.500000,69621.713378,2.469066e+06